<?php

namespace App\Controllers;

use App\Config;
use App\Models\User;
use App\Models\Utils\Post;
use App\Models\Utils\Helper;
use \Core\View;

use PDO;
use MySQLi;

class Site extends \Core\Controller
{
    private $manNames = array("Аарон","Абрам","Аваз","Августин","Авраам","Агап","Агапит","Агат","Агафон",
        "Адам","Адриан","Азамат","Азат","Азиз","Аид","Айдар","Айрат","Акакий","Аким","Алан","Александр",
        "Алексей","Али","Алик","Алим","Алихан","Алишер","Алмаз","Альберт","Амир","Амирам","Амиран","Анар","Анастасий",
        "Анатолий","Анвар","Ангел","Андрей","Анзор","Антон","Анфим","Арам","Аристарх","Аркадий","Арман","Армен","Арсен","Арсений",
        "Арслан","Артём","Артемий","Артур","Архип","Аскар","Аслан","Асхан","Асхат","Ахмет","Ашот","Бахрам","Бенджамин","Блез","Богдан",
        "Борис","Борислав","Бронислав","Булат","Вадим","Валентин","Валерий","Вальдемар","Вардан","Василий","Вениамин","Виктор","Вильгельм","Вит","Виталий","Влад","Владимир","Владислав","Владлен","Влас","Всеволод","Вячеслав","Гавриил","Гамлет","Гарри","Геннадий","Генри","Генрих","Георгий","Герасим","Герман","Германн","Глеб","Гордей","Григорий","Густав","Давид","Давлат","Дамир","Дана","Даниил","Данил","Данис","Данислав","Даниэль","Данияр","Дарий","Даурен","Демид","Демьян","Денис","Джамал","Джан","Джеймс","Джереми","Иеремия","Джозеф","Джонатан","Дик","Дин","Динар","Дино","Дмитрий","Добрыня","Доминик","Евгений","Евдоким","Евсей","Евстахий","Егор","Елисей","Емельян","Еремей","Ефим","Ефрем","Ждан","Жерар","Жигер","Закир","Заур","Захар","Зенон","Зигмунд","Зиновий","Зураб","Зуфар","Ибрагим","Иван","Игнат","Игнатий","Игорь","Иероним","Джером","Иисус","Ильгиз","Ильнур","Ильшат","Илья","Ильяс","Имран","Иннокентий","Ираклий","Исаак","Исаакий","Исидор","Искандер","Ислам","Исмаил","Итан","Казбек","Камиль","Карен","Карим","Карл","Ким","Кир","Кирилл","Клаус","Клим","Конрад","Константин","Коре","Корнелий","Кристиан","Кузьма","Лаврентий","Ладо","Лев","Ленар","Леон","Леонард","Леонид","Леопольд","Лоренс","Лука","Лукиллиан","Лукьян","Любомир","Людвиг","Людовик","Люций","Маджид","Майкл","Макар","Макарий","Максим","Максимилиан","Максуд","Мансур","Мар","Марат","Марк","Марсель","Мартин","Мартын","Матвей","Махмуд","Мика","Микула","Милослав","Мирон","Мирослав","Михаил","Моисей","Мстислав","Мурат","Муслим","Мухаммед","Мэтью","Назар","Наиль","Нариман","Нестор","Ник","Никита","Никодим","Никола","Николай","Нильс","Огюст","Олег","Оливер","Орест","Орландо","Осип","Иосиф","Оскар","Осман","Остап","Остин","Павел","Панкрат","Патрик","Педро","Перри","Пётр","Платон","Потап","Прохор","Равиль","Радий","Радик","Радомир","Радослав","Разиль","Раиль","Райан","Раймонд","Рамазан","Рамзес","Рамиз","Рамиль","Рамон","Ранель","Расим","Расул","Ратибор","Ратмир","Раушан","Рафаэль","Рафик","Рашид","Ринат","Ренат","Ричард","Роберт","Родим","Родион","Рожден","Ролан","Роман","Ростислав","Рубен","Рудольф","Руслан","Рустам","Рэй","Савва","Савелий","Саид","Салават","Самат","Самвел","Самир","Самуил","Санжар","Сани","Святослав","Севастьян","Семён","Серафим","Сергей","Сидор","Симба","Соломон","Спартак","Станислав","Степан","Сулейман","Султан","Сурен","Тагир","Таир","Тайлер","Талгат","Тамаз","Тамерлан","Тарас","Тахир","Тигран","Тимофей","Тимур","Тихон","Томас","Трофим","Уинслоу","Умар","Устин","Фазиль","Фарид","Фархад","Фёдор","Федот","Феликс","Филипп","Флор","Фома","Фред","Фридрих","Хабиб","Хаким","Харитон","Хасан","Цезарь","Цефас","Цецилий","Сесил","Цицерон","Чарльз","Чеслав","Чингиз","Шамиль","Шарль","Шерлок","Эдгар","Эдуард","Эльдар","Эмиль","Эмин","Эрик","Эркюль","Эрмин","Эрнест","Эузебио","Юлиан","Юлий","Юнус",
        "Юрий","Юстиниан","Юстус","Яков","Ян","Яромир","Ярослав");

    private $manLastNames = array("Абрамов","Авдеев","Агапов","Агафонов","Агеев","Акимов","Аксенов","Александров","Алексеев","Алехин","Алешин","Ананьев","Андреев","Андрианов","Аникин","Анисимов","Анохин","Антипов","Антонов","Артамонов","Артемов","Артемьев","Архипов","Астафьев","Астахов","Афанасьев","Бабушкин","Баженов","Балашов","Баранов","Барсуков","Басов","Безруков","Беликов","Белкин","Белов","Белозёров","Белоусов","Беляев","Беляков","Березин","Беспалов","Бессонов","Бирюков","Блинов","Блохин","Бобров","Бобылёв","Богданов","Богомолов","Болдырев","Большаков","Бондарев","Борисов","Бородин","Бочаров","Брагин","Булатов","Булгаков","Буров","Быков","Бычков","Вавилов","Васильев","Вдовин","Верещагин","Веселов","Вешняков","Виноградов","Винокуров","Вишневский","Вишняков","Владимиров","Власов","Волков","Волошин","Воробьев","Воронин","Воронков","Воронов","Воронцов","Высоцкий","Гаврилов","Галкин","Герасимов","Гладков","Глебов","Глухов","Глушков","Голиков","Голованов","Головин","Голубев","Гончаров","Горбачев","Горбунов","Гордеев","Горелов","Горлов","Горохов","Горшков","Горюнов","Горячев","Грачев","Греков","Грибов","Григорьев","Гришин","Громов","Губанов","Гуляев","Гуров","Гурьев","Гусев","Гущин","Давыдов","Данилов","Дегтярев","Дементьев","Демидов","Демин","Демьянов","Денисов","Дмитриев","Добрынин","Долгов","Доронин","Дорофеев","Дорохов","Дроздов","Дружинин","Дубинин","Дубов","Дубровин","Дьяков","Дьяконов","Дьячков","Евдокимов","Евсеев","Егоров","Ежов","Елизаров","Елисеев","Емельянов","Еремеев","Еремин","Ермаков","Ермилов","Ермолаев","Ермолов","Ерофеев","Ершов","Ефимов","Ефремов","Жаров","Жданов","Жилин","Жуков","Журавлев","Завьялов","Зайцев","Захаров","Зверев","Звягинцев","Зеленин","Зимин","Зиновьев","Злобин","Золотарев","Золотов","Зорин","Зотов","Зубков","Зубов","Зуев","Зыков","Иванов","Игнатов","Игнатьев","Измайлов","Ильин","Ильинский","Исаев","Исаков","Кабанов","Казаков","Казанцев","Калачев","Калашников","Калинин","Калмыков","Калугин","Капустин","Карасев","Карпов","Карташов","Касаткин","Касьянов","Киреев","Кириллов","Киселев","Климов","Клюев","Князев","Ковалев","Кожевников","Козин","Козлов","Козловский","Козырев","Колесников","Колесов","Колобов","Колосов","Колпаков","Кольцов","Комаров","Комиссаров","Кондратов","Кондратьев","Кондрашов","Коновалов","Кононов","Константинов","Копылов","Корнев","Корнеев","Корнилов","Коровин","Королев","Корольков","Коротков","Корчагин","Коршунов","Косарев","Костин","Котов","Кочергин","Кочетков","Кочетов","Кошелев","Кравцов","Красильников","Краснов","Круглов","Крылов","Крюков","Крючков","Кудрявцев","Кудряшов","Кузин","Кузнецов","Кузьмин","Кукушкин","Кулагин","Кулаков","Кулешов","Куликов","Куприянов","Курочкин","Лаврентьев","Лавров","Лазарев","Лапин","Лаптев","Лапшин","Ларин","Ларионов","Латышев","Лебедев","Левин","Леонов","Леонтьев","Литвинов","Лихачёв","Лобанов","Логинов","Лопатин","Лосев","Лукин","Лукьянов","Лыков","Лыткин","Львов","Любимов","Майоров","Макаров","Макеев","Максимов","Малахов","Малинин","Малышев","Мальцев","Мамонтов","Маркелов","Маркин","Марков","Мартынов","Масленников","Маслов","Матвеев","Медведев","Мельников","Меркулов","Меркушев","Мешков","Мещеряков","Минаев","Минин","Миронов","Митрофанов","Михайлов","Михеев","Мишин","Моисеев","Молчанов","Моргунов","Морозов","Москвин","Муравьев","Муратов","Мухин","Мясников","Назаров","Наумов","Некрасов","Нестеров","Нефедов","Нечаев","Никитин","Никифоров","Николаев","Никольский","Никонов","Никулин","Новиков","Носков","Носов","Овсянников","Овчинников","Одинцов","Озеров","Окулов","Олейников","Орехов","Орлов","Осипов","Островский","Павлов","Павловский","Панин","Панков","Панкратов","Панов","Пантелеев","Панфилов","Парамонов","Парфенов","Пастухов","Пахомов","Пестов","Петров","Петровский","Петухов","Пименов","Пирогов","Платонов","Плотников","Поздняков","Покровский","Поликарпов","Поляков","Пономарев","Попов","Постников","Потапов","Прокофьев","Прохоров","Пугачев","Раков","Рогов","Родин","Родионов","Рожков","Розанов","Романов","Рубцов","Рудаков","Руднев","Румянцев","Русаков","Русанов","Рыбаков","Рыжов","Рябинин","Рябов","Савельев","Савин","Савицкий","Сазонов","Сальников","Самойлов","Самсонов","Сафонов","Сахаров","Свешников","Свиридов","Севастьянов","Седов","Селезнев","Селиванов","Селиверстов","Семенов","Семин","Сергеев","Серебряков","Серов","Сидоров","Сизов","Силин","Симонов","Синицын","Ситников","Скворцов","Смирнов","Снегирев","Соболев","Соколов","Соловьев","Сомов","Сорокин","Сотников","Софронов","Спиридонов","Стариков","Старостин","Степанов","Столяров","Стрелков","Субботин","Суворов","Судаков","Сурков","Суслов","Суханов","Сухарев","Сухов","Сысоев","Сычев","Тарасов","Терентьев","Терехов","Тетерин","Тимофеев","Титов","Тихомиров","Тихонов","Ткачев","Токарев","Толкачев","Третьяков","Трифонов","Троицкий","Трофимов","Трошин","Туманов","Туров","Уваров","Ульянов","Усов","Успенский","Устинов","Уткин","Ушаков","Фадеев","Федоров","Федосеев","Федосов","Федотов","Фетисов","Филатов","Филимонов","Филиппов","Фирсов","Фокин","Фомин","Фомичев","Фролов","Харитонов","Хомяков","Хохлов","Хромов","Худяков","Царев","Цветков","Чеботарев","Черепанов","Черкасов","Чернов","Черный","Черных","Чернышев","Черняев","Чесноков","Чижов","Чистяков","Чумаков","Шаповалов","Шапошников","Шарапов","Шаров","Шашков","Швецов","Шевелев","Шевцов","Шестаков","Шилов","Широков","Ширяев","Шишкин","Шмелев","Шубин","Шувалов","Шульгин",
        "Щеглов","Щербаков","Щукин","Юдин","Яковлев","Якушев","Яшин");

    private $womanNames = array("Ава", "Августа", "Августина", "Авдотья", "Аврора", "Агапия", "Агата", "Агафья", "Аглая", "Агния", "Агунда", "Ада", "Аделаида", "Аделина", "Адель", "Адиля", "Адриана", "Аза", "Азалия", "Азиза", "Аида", "Аиша", "Ай", "Айару", "Айгерим", "Айгуль", "Айлин", "Айнагуль", "Айнур", "Айсель", "Айсун", "Айсылу", "Аксинья", "Алана", "Алевтина", "Александра", "Алёна", "Алеста", "Алина", "Алиса", "Алия", "Алла", "Алсу", "Алтын", "Альба", "Альбина", "Альфия", "Аля", "Амалия", "Амаль", "Амина", "Амира", "Анаит", "Анастасия", "Ангелина", "Анжела", "Анжелика", "Анисья", "Анита", "Анна", "Антонина", "Анфиса", "Аполлинария", "Арабелла", "Ариадна", "Ариана", "Арианда", "Арина", "Ария", "Асель", "Асия", "Астрид", "Ася", "Афина", "Аэлита", "Аяна", "Бажена", "Беатрис", "Бела", "Белинда", "Белла", "Бэлла", "Берта", "Богдана", "Божена", "Бьянка", "Валентина", "Валерия", "Ванда", "Ванесса", "Варвара", "Василина", "Василиса", "Венера", "Вера", "Вероника", "Веста", "Вета", "Викторина", "Виктория", "Вилена", "Виола", "Виолетта", "Вита", "Виталина", "Виталия", "Влада", "Владана", "Владислава", "Габриэлла", "Галина", "Галия", "Гаяна", "Гаянэ", "Генриетта", "Глафира", "Гоар", "Грета", "Гульзира", "Гульмира", "Гульназ", "Гульнара", "Гульшат", "Гюзель", "Далида", "Дамира", "Дана", "Даниэла", "Дания", "Дара", "Дарина", "Дарья", "Даяна", "Джамиля", "Дженна", "Дженнифер", "Джессика", "Джиневра", "Диана", "Дильназ", "Дильнара", "Диля", "Дилярам", "Дина", "Динара", "Долорес", "Доминика", "Домна", "Домника", "Ева", "Евангелина", "Евгения", "Евдокия", "Екатерина", "Елена", "Елизавета", "Есения", "Ея", "Жаклин", "Жанна", "Жансая", "Жасмин", "Жозефина", "Жоржина", "Забава", "Заира", "Залина", "Замира", "Зара", "Зарема", "Зарина", "Земфира", "Зинаида", "Зита", "Злата", "Златослава", "Зоряна", "Зоя", "Зульфия", "Зухра", "Иветта", "Ивета", "Изабелла", "Илина", "Иллирика", "Илона", "Ильзира", "Илюза", "Инга", "Индира", "Инесса", "Инна", "Иоанна", "Ира", "Ирада", "Ираида", "Ирина", "Ирма", "Искра", "Ия", "Камила", "Камилла", "Кара", "Каре", "Карима", "Карина", "Каролина", "Кира", "Клавдия", "Клара", "Констанция", "Кора", "Корнелия", "Кристина", "Ксения", "Лада", "Лана", "Лара", "Лариса", "Лаура", "Лейла", "Леона", "Лера", "Леся", "Лета", "Лиана", "Лидия", "Лиза", "Лика", "Лили", "Лилиана", "Лилит", "Лилия", "Лина", "Линда", "Лиора", "Лира", "Лия", "Лола", "Лолита", "Лора", "Луиза", "Лукерья", "Лукия", "Луна", "Любава", "Любовь", "Людмила", "Люсиль", "Люсьена", "Люция", "Люче", "Ляйсан", "Ляля", "Мавиле", "Мавлюда", "Магда", "Магдалeна", "Мадина", "Мадлен", "Майя", "Макария", "Малика", "Мара", "Маргарита", "Марианна", "Марика", "Марина", "Мария", "Мариям", "Марта", "Марфа", "Мелания", "Мелисса", "Мехри", "Мика", "Мила", "Милада", "Милана", "Милен", "Милена", "Милица", "Милослава", "Мина", "Мира", "Мирослава", "Мирра", "Михримах", "Мишель", "Мия", "Моника", "Муза", "Надежда", "Наиля", "Наима", "Нана", "Наоми", "Наргиза", "Наталья", "Нелли", "Нея", "Ника", "Николь", "Нина", "Нинель", "Номина", "Нора", "Нурия", "Одетта", "Оксана", "Октябрина", "Олеся", "Оливия", "Ольга", "Офелия", "Павлина", "Памела", "Патриция", "Паула", "Пейтон", "Пелагея", "Перизат", "Платонида", "Полина", "Прасковья", "Равшана", "Рада", "Разина", "Раиля", "Раиса", "Ралина", "Рамина", "Раяна", "Ребекка", "Регина", "Резеда", "Рена", "Рената", "Риана", "Рианна", "Рикарда", "Римма", "Рина", "Рита", "Рогнеда", "Роза", "Роксана", "Роксолана", "Рузалия", "Рузанна", "Русалина", "Руслана", "Руфина", "Руфь", "Сабина", "Сабрина", "Сажида", "Саида", "Салима", "Саломея", "Сальма", "Самира", "Сандра", "Сания", "Сара", "Сати", "Сауле", "Сафия", "Сафура", "Светлана", "Севар", "аСелена", "Сельма", "Серафима", "Сильвия", "Симона", "Снежана", "Соня", "Софья", "Стелла", "Стефания", "Сусанна", "Таисия", "Тамара", "Тамила", "Тара", "Татьяна", "Тая", "Таяна", "Теона", "Тереза", "Тея", "Тина", "Тиффани", "Томирис", "Тора", "Тэмми", "Ульяна", "Ума", "Урсула", "Устинья", "Фазиля", "Фаина", "Фарида", "Фариза", "Фатима", "Федора", "Фёкла", "Фелисити", "Фелиция", "Феруза", "Физалия", "Фируза", "Флора", "Флорентина", "Флоренция", "Флоренс", "Флориана", "Фредерика", "Фрида", "Хадия", "Хилари", "Хлоя", "Хюррем", "Цагана", "Цветана", "Цецилия", "Сесилия", "Циара", "Сиара", "Челси", "Чеслава", "Чулпан", "Шакира", "Шарлотта", "Шахина", "Шейла", "Шелли", "Шерил", "Эвелина",
        "Эвита", "Элеонора", "Элиана", "Элиза", "Элина", "Элла", "Эльвина", "Эльвира", "Эльмира", "Эльнара",
        "Эля", "Эмили", "Эмилия", "Эмма", "Энже", "Эрика", "Эрмина", "Эсмеральда", "Эсмира", "Эстер", "Этель",
        "Этери", "Юлианна", "Юлия", "Юна", "Юния", "Юнона", "Ядвига", "Яна", "Янина", "Ярина", "Ярослава", "Ясмина");

    private $hiMessages = array("Привет, как ты?", "Привет, как дела?", "Здорова!", "Че, ты где?", "Лампа, бадампа", "Хаю хай", "Бабах",
		"Привет, братюнь!", "хау из ит гоинг?", "Супт готов, вкусный борщ", "Вот еще одна фразочка", "Пока, до встречи!", "А что, так можно было?", "О, да...", "И где ты там?", "Слышь, малыш", "Сам ты малыш", "Лес кругом", "Вода очень чистая, приезжай", "Опять ты старое вспомнил", "Не ну а как иначе?", "Блин!", "Чепуха, так не будет", "Ага");

    protected function before()
    {
    }

    protected function after()
    {
    }

    public function logoutAction()
    {
        setcookie('FBID', '', time() - 60 * 60 * 24, '/', null, null, true);
        header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME'] . '/index.php?site/login');
    }

    private function getRandomManName()
    {
        return $this->manNames[rand (1, count($this->manNames) )];
    }
    private function getRandomWomanName()
    {
        return $this->womanNames[rand (1, count($this->womanNames) )];
    }
    private function getRandomManLastName()
    {
        return $this->manLastNames[rand (0, (count($this->manLastNames) - 1) )];
    }
    private function getRandomHi()
    {
        return $this->hiMessages[rand (0, (count($this->hiMessages) - 1) )];
    }
    private function generateRandomString($length = 10) {
        $characters = '0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ';
        $charactersLength = strlen($characters);
        $randomString = '';
        for ($i = 0; $i < $length; $i++) {
            $randomString .= $characters[rand(0, $charactersLength - 1)];
        }
        return $randomString;
    }
    private function getRandomBirthDate()
    {
        return rand (1970, 2019) .'-'. rand (1, 12) .'-'. rand (1, 28);
    }

    public function testAction()
    {
        $sqlConcatStr = "INSERT INTO `user` VALUES ";
        static $db;
        $dsn = 'mysql:host=localhost;dbname=social;charset=utf8';
        $db = new PDO($dsn, 'social', 'hLAL2@-dq3-9iPDaoidf');
        $db->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

        $counter = 40;
        for ($i = 1; $i <= $counter; $i++) {
            $value = '(DEFAULT, '
                .'\''. self::generateRandomString(8) .'.mail@mail.ru\','
                .'\''. password_hash('Qwerty1', PASSWORD_BCRYPT, [ 'cost' => 11 ]) .'\','
                .'\''. sha1('jhdfj02380fdu0wfhu23dfsodfuds') .'\','
                .'\''. self::getRandomManName() .'\','
                .'\''. self::getRandomManLastName() .'\','
                .'\''. self::getRandomBirthDate() .'\','
                .'\'\','
                .'\'\','
                .'\'\','
                .'\'m\')';
            $sqlConcatStr .= $value;
            if ($i !== $counter) {
                $sqlConcatStr .= ',';
            }
        }
        $db->exec($sqlConcatStr);
        echo 'Add '. $counter .' OK';
        exit();
    }

    public function messageAction()
    {
        echo 'OK';
        /*$sqlConcatStr = "INSERT INTO `message` VALUES ";
        static $db;
        $dsn = 'mysql:host=localhost;dbname=social;charset=utf8';
        $db = new PDO($dsn, 'social', 'hLAL2@-dq3-9iPDaoidf');
        $db->setAttribute(PDO::ATTR_ERRMODE, PDO::ERRMODE_EXCEPTION);

        $counter = 10;
        for ($i = 1; $i <= $counter; $i++) {
            $value = '(DEFAULT, '
                . rand (1, 1000000) .','
                . rand (1, 1000000) .','
                .'\''. self::getRandomHi() .'\','
                .'\'2020-07-30 19:15:27\')';
            $sqlConcatStr .= $value;
            if ($i !== $counter) {
                $sqlConcatStr .= ',';
            }
        }
        $db->exec($sqlConcatStr);
        echo 'Add '. $counter .' OK';
        exit();*/
    }

    public function peopleAction($params = [])
    {
        if (empty($_GET) || !array_key_exists ('site/people', $_GET) || empty(trim($_GET['site/people']))) {
            View::renderTemplate('site/people.html', [
                'people' => []
            ]);
            return;
        }
        // TODO при поиске могут меняться имя-фам местами

        $findableNameStr = htmlspecialchars(trim(urldecode($_GET['site/people'])));
        $findableNameArr = explode(' ', $findableNameStr);
        $firstName = count($findableNameArr) > 0 ? $findableNameArr[0] : '';
        $lastName = count($findableNameArr) > 1 ? $findableNameArr[1] : '';

        $findableUsers = User::findUsersByName($firstName, $lastName);
        $preparedFindableUsers = Helper::eraseSecretUserData($findableUsers);

        View::renderTemplate('site/people.html', [
            'people' => $preparedFindableUsers
        ]);
    }

    public function loginAction()
    {
        $user = User::getCurrentUser();

        if (!empty($user)) {
            header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME'] . '/index.php?home/feed');
        }

        // вывод страницы авторизации/регистрации
        if (empty($_POST)) {
            View::renderTemplate('site/login.html'); // отдать шаблон профиля
            return;
        }

        // авторизация
        $errors = array();
        if (!empty($_POST['login_email']) && !empty($_POST['login_password'])) {
            $loginEmail = Post::prepareUserInput($errors, $_POST['login_email']);
            $loginPassword = Post::prepareUserInput($errors, $_POST['login_password']);

            if (!empty($errors)) {
                header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME']
                    . '/index.php?site/login');
                return;
            }

            $user = User::getUserByEmail($loginEmail);
            if (!$user) {
                header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME']
                    . '/index.php?site/login');
                return;
            }
            if (!password_verify($loginPassword, $user[0]['password'])) {
                header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME']
                    . '/index.php?site/login');
                return;
            }
            // создать токен и обновить в бд
            $cryptoFlag = true;
            $token = bin2hex(openssl_random_pseudo_bytes(64, $cryptoFlag));
            User::updateTokenByEmail($loginEmail, $token);

            setcookie('FBID', $token, time() + 60 * 60 * 24 * 7, '/', null, null, true);
            header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME']
                . '/index.php?home/profile');
            return;
        }

        $errors = array();
        $firstName = Post::prepareUserInput($errors, $_POST['first_name']);
        $lastName = Post::prepareUserInput($errors, $_POST['last_name']);
        $email = Post::prepareUserInput($errors, $_POST['email']);
        $password = Post::prepareUserInput($errors, $_POST['password']);
        $birthDay = Post::prepareUserInput($errors, $_POST['birth_day']);
        $birthMonth = Post::prepareUserInput($errors, $_POST['birth_month']);
        $birthYear = Post::prepareUserInput($errors, $_POST['birth_year']);
        $gender = Post::prepareUserInput($errors, $_POST['gender']);

        if (!empty($errors)) {
            header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME']
                . '/index.php?site/login');
            return;
        }

        $user = new User();
        $user->email = $email;
        $user->password = password_hash($password, PASSWORD_BCRYPT, [ 'cost' => 11 ]); //$password;
        $user->firstName = $firstName;
        $user->lastName = $lastName;
        $user->birthday = date_create(date( $birthYear .'-'. $birthMonth .'-'. $birthDay ));
        $user->country = NULL;
        $user->city = NULL;
        $user->interests = NULL;
        $user->gender = $gender;

        $cryptoStrong = true;
        $user->token = bin2hex(openssl_random_pseudo_bytes(64, $cryptoStrong));
        $user->save();

        setcookie('FBID', $user->token, time() + 60 * 60 * 24 * 7, '/', null, null, true);
        header('Location: '. $_SERVER['REQUEST_SCHEME'] . '://'. $_SERVER['SERVER_NAME'] . '/index.php?home/profile');
    }
}
